onliner10/edgetx/radio/src/targets/common/arm/stm32/usb_driver.cpp
/*
 * Copyright (C) EdgeTX
 *
 * Based on code named
 *   opentx - https://github.com/opentx/opentx
 *   th9x - http://code.google.com/p/th9x
 *   er9x - http://code.google.com/p/er9x
 *   gruvin9x - http://code.google.com/p/gruvin9x
 *
 * License GPLv2: http://www.gnu.org/licenses/gpl-2.0.html
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 */

#if defined(USBJ_EX)
#include "usb_joystick.h"
#else
#include "edgetx_helpers.h"
#include "dataconstants.h"
#include "globals.h"
#endif

extern "C" {
  #include "usbd_conf.h"
  #include "usbd_core.h"
  #include "usbd_msc.h"
  #include "usbd_desc.h"
  #include "usbd_hid.h"
  #include "usbd_cdc.h"
  #include "usbd_dfu.h"
}

#include "stm32_hal_ll.h"
#include "stm32_hal.h"

#include "stm32_gpio.h"

#include "hal/gpio.h"
#include "hal/usb_driver.h"

#include "hal.h"
#include "debug.h"

#if !defined(BOOT)
#include "os/task.h"

#include <atomic>
#endif

#if defined(USE_USB_HS)
  #define DEVICE_ID DEVICE_HS
#else
  #define DEVICE_ID DEVICE_FS
#endif

#if defined(BOOT)

// TODO: configured where needed
#define DEFAULT_USB_MODE USB_MASS_STORAGE_MODE;
#if defined(FIRMWARE_QSPI)
static const USBD_DFU_MediaTypeDef* _dfu_media[USBD_DFU_MAX_ITF_NUM] = {nullptr};
#endif

#else
#define DEFAULT_USB_MODE USB_UNSELECTED_MODE;
#endif

namespace {

#if !defined(BOOT)
mutex_handle_t usbDriverMutex;

class UsbDriverCriticalSection
{
 public:
  UsbDriverCriticalSection()
  {
    if (scheduler_is_running()) locked = mutex_lock(&usbDriverMutex);
  }

  ~UsbDriverCriticalSection()
  {
    if (locked) mutex_unlock(&usbDriverMutex);
  }

  UsbDriverCriticalSection(const UsbDriverCriticalSection&) = delete;
  UsbDriverCriticalSection& operator=(const UsbDriverCriticalSection&) = delete;

 private:
  bool locked = false;
};

std::atomic_bool usbDriverStarted{false};

// Cached debounced USB VBUS state. Written by usbPlugged() (main task only),
// read by usbIsPlugged() (any context). Single-writer, multiple-reader.
std::atomic<bool> usbPluggedCached{false};

bool usbDriverIsStarted()
{
  return usbDriverStarted.load(std::memory_order_acquire);
}

void setUsbDriverStarted(bool started)
{
  usbDriverStarted.store(started, std::memory_order_release);
}
#else
class UsbDriverCriticalSection
{
 public:
  UsbDriverCriticalSection() = default;
  UsbDriverCriticalSection(const UsbDriverCriticalSection&) = delete;
  UsbDriverCriticalSection& operator=(const UsbDriverCriticalSection&) = delete;
};

bool usbDriverStarted = false;

bool usbDriverIsStarted()
{
  return usbDriverStarted;
}

void setUsbDriverStarted(bool started)
{
  usbDriverStarted = started;
}
#endif

}  // namespace

#if !defined(BOOT)
static std::atomic<int> selectedUsbMode{USB_UNSELECTED_MODE};
#else
static usbMode selectedUsbMode = USB_MASS_STORAGE_MODE;
#endif

USBD_HandleTypeDef hUsbDevice;

int getSelectedUsbMode()
{
#if !defined(BOOT)
  return selectedUsbMode.load(std::memory_order_relaxed);
#else
  return selectedUsbMode;
#endif
}

void setSelectedUsbMode(int mode)
{
#if !defined(BOOT)
  selectedUsbMode.store(mode, std::memory_order_relaxed);
#else
  selectedUsbMode = usbMode(mode);
#endif
}

#if defined(USB_GPIO_VBUS)
int usbPlugged()
{
#if defined(DEBUG_DISABLE_USB) && !defined(BOOT)
  return false;
#endif

  static uint8_t debouncedState = 0;
  static uint8_t lastState = 0;

#if defined(USB_GPIO_VBUS_OPEN_DRAIN)
  uint8_t state = gpio_read(USB_GPIO_VBUS) ? 0 : 1;
#else
  uint8_t state = gpio_read(USB_GPIO_VBUS) ? 1 : 0;
#endif
  if (state == lastState)
    debouncedState = state;
  else
    lastState = state;

#if !defined(BOOT)
  usbPluggedCached.store(debouncedState != 0, std::memory_order_release);
#endif

  return debouncedState;
}
#endif

extern PCD_HandleTypeDef hpcd_USB_OTG;

#if defined(USE_USB_HS)
extern "C" void OTG_HS_IRQHandler()
{
  DEBUG_INTERRUPT(INT_OTG_FS);
  HAL_PCD_IRQHandler(&hpcd_USB_OTG);
}
#else
extern "C" void OTG_FS_IRQHandler()
{
  DEBUG_INTERRUPT(INT_OTG_FS);
  HAL_PCD_IRQHandler(&hpcd_USB_OTG);
}
#endif

void usbInit()
{
#if !defined(BOOT)
  mutex_create(&usbDriverMutex);
#endif

#if defined(STM32H7)
  HAL_PWREx_EnableUSBVoltageDetector();
#endif
  gpio_init_af(USB_GPIO_DM, USB_GPIO_AF, GPIO_PIN_SPEED_VERY_HIGH);
  gpio_init_af(USB_GPIO_DP, USB_GPIO_AF, GPIO_PIN_SPEED_VERY_HIGH);
  
#if defined(USB_GPIO_VBUS)
#if defined(USB_GPIO_VBUS_OPEN_DRAIN)
  gpio_init(USB_GPIO_VBUS, GPIO_IN_PU, GPIO_PIN_SPEED_LOW);
#else
  gpio_init(USB_GPIO_VBUS, GPIO_IN, GPIO_PIN_SPEED_LOW);
#endif
  // prime debounce state...
  usbPlugged();
#endif

// TODO: seems this is only needed for USB wakeup,
//       which we do not support.
#if !defined(STM32H7RS)
#if defined(LL_APB2_GRP1_PERIPH_SYSCFG)
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);
#elif defined(LL_APB4_GRP1_PERIPH_SYSCFG)
  LL_APB4_GRP1_EnableClock(LL_APB4_GRP1_PERIPH_SYSCFG);
#else
  #error "Unable to enable SYSCFG peripheral clock"
#endif
#endif

  setUsbDriverStarted(false);
}

extern void usbInitLUNs();
extern USBD_HandleTypeDef hUsbDevice;
extern "C" USBD_StorageTypeDef USBD_Storage_Interface_fops;
extern USBD_CDC_ItfTypeDef USBD_Interface_fops;
extern USBD_DFU_MediaTypeDef USBD_DFU_MEDIA_fops;

void usbStart()
{
  [[maybe_unused]] UsbDriverCriticalSection lock;

  // USBD_Init re-enables the NVIC OTG IRQ via HAL_PCD_MspInit.  SOF and RX
  // callbacks may fire once the device connects, but usbStarted() is false
  // until USBD_Start succeeds, so ISR guards in VCP_StartOfFrame_FS and
  // VCP_Receive_FS will bail safely.
  setUsbDriverStarted(false);
  USBD_Init(&hUsbDevice, &FS_Desc, DEVICE_ID);
  switch (getSelectedUsbMode()) {
    case USB_MASS_STORAGE_MODE:
      // initialize USB as MSC device
      usbInitLUNs();
      USBD_RegisterClass(&hUsbDevice, &USBD_MSC);
      USBD_MSC_RegisterStorage(&hUsbDevice, &USBD_Storage_Interface_fops);
      break;

#if defined(BOOT)
#if defined(FIRMWARE_QSPI)
    case USB_DFU_MODE:
      USBD_RegisterClass(&hUsbDevice, &USBD_DFU);
      for (unsigned i = 0; i < USBD_DFU_MAX_ITF_NUM; i++){
        if (_dfu_media[i] != nullptr) {
          USBD_DFU_RegisterMedia(&hUsbDevice,
                                 (USBD_DFU_MediaTypeDef*)_dfu_media[i]);
        }
      }
      break;
#endif // !defined(STM32H7) && !defined(STM32H7RS)
#else
    case USB_JOYSTICK_MODE:
      // initialize USB as HID device
#if defined(USBJ_EX)
      setupUSBJoystick();
#endif
      USBD_RegisterClass(&hUsbDevice, &USBD_HID);
      break;
#if defined(USB_SERIAL)
    case USB_SERIAL_MODE:
      // initialize USB as CDC device (virtual serial port)
      USBD_RegisterClass(&hUsbDevice, &USBD_CDC);
      USBD_CDC_RegisterInterface(&hUsbDevice, &USBD_Interface_fops);
      break;
#endif
#endif

    default:
      return;
  }

  if (USBD_Start(&hUsbDevice) == USBD_OK) {
    setUsbDriverStarted(true);
  }
}

void usbStop()
{
  [[maybe_unused]] UsbDriverCriticalSection lock;
  if (!usbDriverIsStarted()) return;
  setUsbDriverStarted(false);

  // Disable the USB OTG interrupt before teardown to prevent ISR callbacks
  // (SOF, RX, etc.) from accessing hUsbDevice after we begin deinit.  The
  // atomic usbStarted() guard in VCP_StartOfFrame_FS provides an additional
  // defence-in-depth check, but NVIC masking closes the entire TOCTOU window.
  // HAL_PCD_MspDeInit inside USBD_DeInit also calls NVIC_DisableIRQ, so this
  // is deliberately redundant — the IRQ must be quiescent before deinit starts.
#if defined(USE_USB_HS)
  NVIC_DisableIRQ(OTG_HS_IRQn);
#else
  NVIC_DisableIRQ(OTG_FS_IRQn);
#endif
  __DSB();
  __ISB();

  USBD_DeInit(&hUsbDevice);

#if defined(USE_USB_HS)
  NVIC_ClearPendingIRQ(OTG_HS_IRQn);
#else
  NVIC_ClearPendingIRQ(OTG_FS_IRQn);
#endif
}


bool usbStarted()
{
  return usbDriverIsStarted();
}

bool usbIsPlugged()
{
#if !defined(BOOT)
  return usbPluggedCached.load(std::memory_order_acquire);
#else
  return usbPlugged() != 0;
#endif
}

#if defined(BOOT)
#if defined(FIRMWARE_QSPI)
int usbRegisterDFUMedia(const void* dfu_media)
{
  for (unsigned i = 0; i < USBD_DFU_MAX_ITF_NUM; i++) {
    if (_dfu_media[i] == nullptr) {
      _dfu_media[i] = (const USBD_DFU_MediaTypeDef*)dfu_media;
      return 0;
    }
  }
  return -1;
}
#endif //  !defined(FIRMWARE_QSPI)
#else // !BOOT

namespace {

bool usbJoystickCanSendReportLocked(const UsbDriverCriticalSection&)
{
  return usbDriverIsStarted() && usbIsPlugged() &&
         getSelectedUsbMode() == USB_JOYSTICK_MODE;
}

uint8_t usbJoystickSendReportLocked(const UsbDriverCriticalSection& lock,
                                    uint8_t* report, uint16_t len)
{
  if (!usbJoystickCanSendReportLocked(lock)) return USBD_FAIL;
  return USBD_HID_SendReport(&hUsbDevice, report, len);
}

}  // namespace

#if defined(USBJ_EX)
extern "C" void delay_ms(uint32_t count);
void usbJoystickRestart()
{
  {
    [[maybe_unused]] UsbDriverCriticalSection lock;
    if (!usbDriverIsStarted() || getSelectedUsbMode() != USB_JOYSTICK_MODE) return;
    setUsbDriverStarted(false);

    // Disable USB OTG interrupt before teardown (see usbStop() for rationale).
#if defined(USE_USB_HS)
    NVIC_DisableIRQ(OTG_HS_IRQn);
#else
    NVIC_DisableIRQ(OTG_FS_IRQn);
#endif
    __DSB();
    __ISB();

    USBD_DeInit(&hUsbDevice);

#if defined(USE_USB_HS)
    NVIC_ClearPendingIRQ(OTG_HS_IRQn);
#else
    NVIC_ClearPendingIRQ(OTG_FS_IRQn);
#endif
  }
  // Mutex released during delay. Mixer task won't send (usbDriverIsStarted is false).
  // usbStop() won't double-deinit (it checks usbDriverIsStarted).
  delay_ms(100);
  {
    [[maybe_unused]] UsbDriverCriticalSection lock;
    if (usbDriverIsStarted()) return;
    // USBD_Init re-enables the NVIC OTG IRQ via HAL_PCD_MspInit.
    USBD_Init(&hUsbDevice, &FS_Desc, DEVICE_ID);
    USBD_RegisterClass(&hUsbDevice, &USBD_HID);
    if (USBD_Start(&hUsbDevice) == USBD_OK) {
      setUsbDriverStarted(true);
    }
  }
}
#endif


/*
  Prepare and send new USB data packet

  The format of HID_Buffer is defined by
  USB endpoint description can be found in
  file usb_hid_joystick.c, variable HID_JOYSTICK_ReportDesc
*/
void usbJoystickUpdate()
{
  [[maybe_unused]] UsbDriverCriticalSection lock;
  if (!usbJoystickCanSendReportLocked(lock)) return;

#if !defined(USBJ_EX)
   static uint8_t HID_Buffer[HID_IN_PACKET];

   //buttons
   HID_Buffer[0] = 0;
   HID_Buffer[1] = 0;
   HID_Buffer[2] = 0;
   for (int i = 0; i < 8; ++i) {
     if ( channelOutputs[i+8] > 0 ) {
       HID_Buffer[0] |= (1 << i);
     }
     if ( channelOutputs[i+16] > 0 ) {
       HID_Buffer[1] |= (1 << i);
     }
     if ( channelOutputs[i+24] > 0 ) {
       HID_Buffer[2] |= (1 << i);
     }
   }

   //analog values
   for (int i = 0; i < 8; ++i) {
     int16_t value = limit<int16_t>(0, channelOutputs[i] + 1024, 2048);;
     HID_Buffer[i*2 +3] = static_cast<uint8_t>(value & 0xFF);
     HID_Buffer[i*2 +4] = static_cast<uint8_t>(value >> 8);
   }
   usbJoystickSendReportLocked(lock, HID_Buffer, HID_IN_PACKET);
#else
  usbReport_t ret = usbReport();
  usbJoystickSendReportLocked(lock, ret.ptr, ret.size);
#endif
}
#endif
